### Отчёт по лабораторной работе

#### Тема: Минимизация разницы между порциями каши

#### Цель:
Разработать алгоритм для Маши и Пети, который поможет минимизировать разницу в порциях каши, разлитых по чашкам с разной граммовкой, и определить минимально возможную разницу.

#### Условие задачи:
Маша и Петя пришли в МИЭМ в 9:30 и обнаружили, что осталась одна порция каши, разлитая в несколько чашек разной граммовки. Задача заключается в том, чтобы распределить чашки с кашей так, чтобы разница между порциями была минимальной.

#### Формат входных данных:
1. В первой строке задано количество чашек `n` (1 ≤ n ≤ 32).
2. Во второй строке заданы массы каши в чашках — целые числа от 1 до \(10^8\).

#### Формат выходных данных:
Вывести одно целое число — минимальную разницу между порциями Маши и Пети.

---

### Алгоритм:

1. **Шаг 1:** Прочитать количество чашек `n` и граммовки каши в чашках.
2. **Шаг 2:** Посчитать общую массу каши.
3. **Шаг 3:** Использовать жадный алгоритм для приближенного разделения каши между двумя людьми:
   - Найти половину от общей массы (переменная `medium`).
   - Перебирать чашки с конца, добавляя их либо к первой порции (если она не превышает половину), либо ко второй порции.
4. **Шаг 4:** Вывести абсолютное значение разницы между двумя порциями.

### Реализация:

```cpp
#include <iostream>
#include <math.h>
using namespace std;

int deferent(int a[], int n) {
    int sum1, sum2, allsum, medium;
    sum1 = 0;
    sum2 = 0;
    allsum = 0;
    for (int i = 0; i < n; i++) {
        allsum  += a[i];
    }
    medium = allsum / 2;
    for (int i = n - 1; i >= 0; i--) {
        if ((sum1 + a[i]) <= medium) {
            sum1 += a[i];
        } else {
            sum2 += a[i];
        }
    }
    return abs(sum1 - sum2);
}

int main(void) {
    int n;
    std::cin >> n;
    int a[n];
    for (int i = 0; i < n; i++) {
        std::cin >> a[i];
    }
    std::cout << deferent(a, n) << std::endl;
    return 0;
}
```

### Пояснение работы программы:

1. **Входные данные:** Сначала программа считывает количество чашек и их массы.
2. **Подсчёт общей массы:** Программа подсчитывает сумму всех масс каши и сохраняет её в переменную `allsum`.
3. **Половинное разделение:** Программа находит половину от общей массы, после чего распределяет кашу между двумя порциями с использованием жадного подхода. Она старается добавить чашки в первую порцию до тех пор, пока её масса не станет больше половины. Оставшиеся чашки попадают во вторую порцию.
4. **Вычисление разницы:** После того как все чашки распределены, программа вычисляет разницу между двумя порциями с помощью функции `abs()`.

### Оценка сложности:

- **Время работы:** Алгоритм использует два цикла: один для вычисления суммы и один для распределения чашек. Таким образом, сложность алгоритма — \(O(n)\), где \(n\) — количество чашек (максимум 32).
- **Память:** Используется массив для хранения масс чашек размером \(n\), что требует \(O(n)\) памяти.

### Преимущества:
- Алгоритм работает быстро при малом количестве чашек (до 32), поскольку количество операций ограничено.
- Простота реализации и минимальные затраты памяти.

### Недостатки:
- Данный алгоритм не всегда даёт оптимальное решение. В некоторых случаях жадный алгоритм может не дать минимальной разницы, так как он не учитывает все возможные комбинации.

### Оптимизация:
Для нахождения гарантированно минимальной разницы между порциями можно использовать динамическое программирование. Этот метод будет более точным, но требует большего времени на выполнение.

---

### Заключение:
Разработанный алгоритм представляет собой жадное приближённое решение задачи минимизации разницы между порциями. Его временная сложность \(O(n)\) делает его эффективным для небольших значений \(n\), но для больших и более сложных случаев стоит рассмотреть использование более точных алгоритмов, таких как динамическое программирование.